//ამოცანა 2. (15 ქულა) 2D მასივის შექმნა
//დაწერეთ create მეთოდი რომელსაც გადაეცემა მთელი რიცხვების მასივი და
//რომელიც აბრუნებს ორგანზომილებიან მთელი რიცხვების მასივს. დაბრუნებული
//მასივების მასივი უნდა იყოს ისეთი, რომ მასში შემავალი
//(ერთგანზომილებიანი) მასივების სიგრძეები ემთხვეოდეს გადაცემული მასივის
//ელემენტებს. დაბრუნებულ მასივების მასივში ყველა ელემენტი უნდა იყოს 0-ის
//ტოლი.
//მაგალითად:
//თუკი მეთოდს გადაეცა მასივი [1,2] ეს ნიშნავს, რომ მეთოდმა უნდა გააკეთოს
//2 ელემენტიანი მასივი, რომლის ნულოვანი ელემენტიც იქნება 1 სიგრძის მთელი
// თბილისის თავისუფალი უნივერსიტეტი
//რიცხვების მასივი, ხოლო პირველი ელემენტი კი 2 სიგრძის მასივი. ანუ უნდა
//დააბრუნოს:
//[[0], [0,0]]
//თუკი მეთოდს გადაეცემა მასივი [2,1,1,2] მაშინ მეთოდმა უნდა დააბრუნოს
//[[0,0],[0],[0],[0,0]]
//ამოხსნა დაწერეთ create.java ფაილში.
import java.util.Arrays;
import acm.program.ConsoleProgram;

public class Final2022Session2Create extends ConsoleProgram{
	public void run() {
		printDoubleArray(create(new int[]{1,2}));
		printDoubleArray(create(new int[]{2,1,1,2}));
	}
	private void printDoubleArray(int[][] arr) {
		print("[");
		
		for(int[] row: arr) {
			print(Arrays.toString(row) + ", ");
		}
		println("]");
	}
	
	private int[][] create(int[] a) {
		int[][] result = new int[a.length][1];
		for(int i = 0; i < a.length; i++) {
			result[i] = new int[a[i]];
		}
		return result;
	}
}

