//ვიდეოს ლინკი:
//https://www.youtube.com/watch?v=XC-zYpS7Guo


//ამოცანა 3. (10 ქულა) ნაგავი
//თქვენი ამოცანაა დათვალოთ რამდენი ტონა ნაგავი იყრება თბილისში ყოველ
//წლიურად. ამისათვის კოდის დაწერა არ დაგჭირდებათ თუმცა ძალიან
//გამოგადგებათ დეკომპოზიციის ცოდნა. გასაგებია, რომ ზუსტი რიცხვის დაწერა
//შეუძლებელია და მხოლოდ მიახლოებით შეიძლება იმსჯელოთ. დაწერეთ ახსნა თუ
//როგორ მიხვედით შედეგამდე. ამოხსნა დაწერეთ garbage.txt ფაილში.
//
//შარშანდელი კრიტერიუმები:
//ნაგავი/კარი
//* რამდენად კომპლექსურია/პრიმიტიულია მოცემულობად ჩათვლილი მონაცემები (მაგ: ზედმეტად პრიმიტიულია ჩათვალო 
//რომ მოცემულობაში გაქვს ერთი დღის მონაცემი და უბრალოდ ეგ გაამრავლო 365 დღეზე)
//* შემოტანილი და გამოთვლილი მონაცემების მიხედვით რამდენად სწორადაა ჩამოყალიბებული გამოთვლის ლოგიკა.
//
//* სწორი დეკომპოზიცია (2-3 სიღრმის) (თუ ზედა ორი კრიტერიუმი დაკმაყოფილებულია დიდი ალბათობით ეს პუნქტიც სრულდება)
//რადგან ეს ორი ამოცანა აბსტრაქტულია და რთულია ერთი კონკრეტული სწორი ვერსიის დაწერა, ზემოთ ნახსენები სამი კრიტერიუმის 
//  მიხედვით მოხდება ძირითადი შეფასება, თუმცა სტუდენტის მიერ შემოთავაზებული კონკრეტული გზის მიხედვით დაიწერება ზუსტი ქულა.
//
//
//wlis raod  - dgis raod * 365
//		sayofacxovrebo, komerciuli
//	adamianis prop() //   qarxnebi(didi nagavi), chveulebrivi biznezi(mg magazia)
//							()						()
//
//
//---------------------------------------
//
//
//წლიური ნაგავი.
//ამოცანაში დავუშვათ რომ ყოველ დღე იყრება დაახლოებით თანაბარი რაოდენობის ნაგავი. დავთვალოთ დღეში დაყრილი ნაგვის რაოდენობა და გავამრავლოთ 365ზე(ან 365.25ზე) .
//ნაგვის ორი ძირითადი წყარო არის საყოფაცხოვრებო საქმიანობით დატოვებული ნაგავი და კომერციული საქმიანობით დატოვებული ნაგავი.  
//საყოფაცხოვრებო ნაგვის რაოდენობა იქნება ადამიანების რაოდენობის პროპორციული. დავუშვათ რომ საშუალოდ ადამიანი აწარმოებს 0.5 კილო ნაგავს დღეში.  
//თბილისის მოსაცლეობა არის  1.5 მლნ. ჯამში 1.5 *0.5= 0.75მლნ კილო
//კომერციული საქმიანობა დავყოთ ორ ნაწილად - ქარხნები და მსგავსი საწარმოები, რომლებიც დიდი რაოდენობის ნაგავს აწარმოებენ და სხვა ბიზნესები (მგ მაღაზია, კოლეჯი ..) 
//ქარხნის ნაგავი - ჩავთვალოთ გვაქვს 200 ქარხანა თბილისში და თითო აწარმოებს 5 000 კგ ნაგავს დღეში = 1 მლნ კგ
//სხვა ბიზნესები - ჩავთვალოთ რომ გვაქვს 50 000 ობიექტი და თითო საშუალოდ აწარმოებს 10 კგ ნაგავს დღეში. = 0.5 მლნ კილო
//ჯამში დღეში - 0.75 + (1 + 0.5)  = 2.25 მლნ
//წელიწადში გამოდის  2.25 * 365 მლნ კგ
//
//
//
